<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Webex Installer and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.JoblessLoser.munki.WebexInstaller</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Webex Installer</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>asannotation2.app</string>
				<string>convertpdf.app</string>
				<string>Cisco Webex Meetings.app</string>
				<string>PTUpdate.app</string>
				<string>washost.app</string>
				<string>Webex Installer.app</string>
				<string>webexmta.app</string>
				<string>WebexAppLauncher.app</string>
				<string>Meeting Center.app</string>
				<string>CaptureHost.app</string>
				<string>wadhost.app</string>
				<string>webexmtaV2.app</string>
				<string>Cisco WebEx Start.app</string>
				<string>Cisco Webex Record Converter.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Make teamwork your best work.</string>
			<key>developer</key>
			<string>Cisco</string>
			<key>display_name</key>
			<string>Webex Installer</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.JoblessLoser.download.WebexInstaller</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
