<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Logseq and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.JoblessLoser.munki.Logseq</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Logseq</string>
		<key>SUPPORTED_ARCH</key>
		<string>arm64</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Braindump everything into Logseq.
New ideas will pop up with time.
Using Logseq helps you organize your thoughts and ideas
so that you can come up with new outputs more easily.</string>
			<key>developer</key>
			<string>Tiansheng Qin</string>
			<key>display_name</key>
			<string>Logseq</string>
			<key>name</key>
			<key>supported_architectures</key>
			<array>
				<string>%SUPPORTED_ARCH%</string>
			</array>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.JoblessLoser.download.Logseq</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
