<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of GoogleUpdater and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.JoblessLoser.munki.GoogleUpdater</string>
	<key>Input</key>
	<dict>
		<key>version</key>
		<string>%version%</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>GoogleUpdater</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Google Sheets.app</string>
				<string>GoogleUpdater.app</string>
				<string>Google Docs.app</string>
				<string>Google Slides.app</string>
				<string>GoogleSoftwareUpdateAgent.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Safely store your files and access them from any device

Choose folders on your computer to sync with Google Drive or backup to Google Photos, and access all of your content directly from your PC or Mac.</string>
			<key>developer</key>
			<string>Google</string>
			<key>display_name</key>
			<string>Google Drive</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>installcheck_script</key>
	<string>#!/bin/bash

ApplicationName="Google Drive"
TargetVersion="%version%"

echo "Checking for version $TargetVersion of $ApplicationName"


if [[ -d "/Library/Application Support/Google/GoogleUpdater/$TargetVersion" ]]
 then
   echo "$ApplicationName is installed"
   exit 1
fi

echo "Version $TargetVersion of $ApplicationName not found"
exit 0
</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.JoblessLoser.download.GoogleUpdater</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
